#+TYP_TODO: TODO MAYBE WAITING NEXT DONE
#+STARTUP: showall
#+STARTUP: hidestars
#+FILETAGS: WORK
#+CONSTANTS: customer=Yoyodyne rate=20.00
#+PROPERTY: RemitTo1 Emacs Consultants LLC
#+PROPERTY: RemitTo2 123 Any Street
#+PROPERTY: RemitTo3 Minneapolis, MN 55401
#+PROPERTY: Terms Net 30
#+PROPERTY: BillTo1 Yoyodyne, Inc.
#+PROPERTY: BillTo2 451 Franklin Street
#+PROPERTY: BillTo3 Boston, MA 02110-1301 USA

* Background

More information about Yoyodyne here

* Tasks
** Prototype
*** Planning
**** NEXT Yoyodyne Prototype: Project Planning
:LOGBOOK:
CLOCK: [2014-04-01 Tue 08:30]--[2014-04-01 Tue 11:00] => 2014-04-01 Tue 08:30 -- 2014-04-01 Tue 11:00 @  2.50
CLOCK: [2014-04-01 Tue 12:00]--[2014-04-01 Tue 17:00] => 2014-04-01 Tue 12:00 -- 2014-04-01 Tue 17:00 @  5.00
:END:
**** NEXT Yoyodyne Prototype: Teleconference
:LOGBOOK:
CLOCK: [2014-04-01 Tue 11:00]--[2014-04-01 Tue 12:00] => 2014-04-01 Tue 11:00 -- 2014-04-01 Tue 12:00 @  1.00
CLOCK: [2014-04-02 Wed 11:00]--[2014-04-02 Wed 12:00] => 2014-04-02 Wed 11:00 -- 2014-04-02 Wed 12:00 @  1.00
CLOCK: [2014-04-03 Thu 11:00]--[2014-04-03 Thu 12:00] => 2014-04-03 Thu 11:00 -- 2014-04-03 Thu 12:00 @  1.00
CLOCK: [2014-04-04 Fri 11:00]--[2014-04-04 Fri 12:00] => 2014-04-04 Fri 11:00 -- 2014-04-04 Fri 12:00 @  1.00
CLOCK: [2014-04-07 Mon 11:00]--[2014-04-07 Mon 12:00] => 2014-04-07 Mon 11:00 -- 2014-04-07 Mon 12:00 @  1.00
CLOCK: [2014-04-08 Tue 11:00]--[2014-04-08 Tue 12:00] => 2014-04-08 Tue 11:00 -- 2014-04-08 Tue 12:00 @  1.00
:END:
*** Development
**** NEXT Yoyodyne Prototype: Storyboard
:LOGBOOK:
CLOCK: [2014-04-02 Wed 08:30]--[2014-04-02 Wed 11:00] => 2014-04-02 Wed 08:30 -- 2014-04-02 Wed 11:00 @  2.50
CLOCK: [2014-04-02 Wed 12:00]--[2014-04-02 Wed 17:00] => 2014-04-02 Wed 12:00 -- 2014-04-02 Wed 17:00 @  5.00
:END:
**** NEXT Yoyodyne Prototype: Feature 1
:LOGBOOK:
CLOCK: [2014-04-03 Thu 08:30]--[2014-04-03 Thu 11:00] => 2014-04-03 Thu 08:30 -- 2014-04-03 Thu 11:00 @  2.50
CLOCK: [2014-04-03 Thu 12:00]--[2014-04-03 Thu 17:00] => 2014-04-03 Thu 12:00 -- 2014-04-03 Thu 17:00 @  5.00
:END:
*** Documentation
**** NEXT Yoyodyne Prototype: User Manual
:LOGBOOK:
CLOCK: [2014-04-04 Fri 08:30]--[2014-04-04 Fri 11:00] => 2014-04-04 Fri 08:30 -- 2014-04-04 Fri 11:00 @  2.50
CLOCK: [2014-04-04 Fri 12:00]--[2014-04-04 Fri 17:00] => 2014-04-04 Fri 12:00 -- 2014-04-04 Fri 17:00 @  5.00
:END:
*** Quality
**** NEXT Yoyodyne Prototype: Write test suite
:LOGBOOK:
CLOCK: [2014-04-07 Mon 08:30]--[2014-04-07 Mon 11:00] => 2014-04-07 Mon 08:30 -- 2014-04-07 Mon 11:00 @  2.50
CLOCK: [2014-04-07 Mon 12:00]--[2014-04-07 Mon 17:00] => 2014-04-07 Mon 12:00 -- 2014-04-07 Mon 17:00 @  5.00
:END:
**** NEXT Yoyodyne Prototype: Setup Jenkins
:LOGBOOK:
CLOCK: [2014-04-08 Tue 08:30]--[2014-04-08 Tue 11:00] => 2014-04-08 Tue 08:30 -- 2014-04-08 Tue 11:00 @  2.50
:END:
** NewProduct
*** Planning
**** NEXT Yoyodyne NewProduct: Project Planning
:LOGBOOK:
CLOCK: [2014-04-08 Tue 12:00]--[2014-04-08 Tue 17:00] => 2014-04-08 Tue 12:00 -- 2014-04-08 Tue 17:00 @  5.00
:END:
* Timesheet
** 2014-04
*** 2014-04-01 Tue = 8.50 hours
**** Prototype = 8.50 hours
***** Planning = 8.50 hours
****** Yoyodyne Prototype: Project Planning = 7.50 hours
****** Yoyodyne Prototype: Teleconference = 1.00 hours
*** 2014-04-02 Wed = 8.50 hours
**** Prototype = 8.50 hours
***** Development = 7.50 hours
****** Yoyodyne Prototype: Storyboard = 7.50 hours
***** Planning = 1.00 hours
****** Yoyodyne Prototype: Teleconference = 1.00 hours
*** 2014-04-03 Thu = 8.50 hours
**** Prototype = 8.50 hours
***** Development = 7.50 hours
****** Yoyodyne Prototype: Feature 1 = 7.50 hours
***** Planning = 1.00 hours
****** Yoyodyne Prototype: Teleconference = 1.00 hours
*** 2014-04-04 Fri = 8.50 hours
**** Prototype = 8.50 hours
***** Documentation = 7.50 hours
****** Yoyodyne Prototype: User Manual = 7.50 hours
***** Planning = 1.00 hours
****** Yoyodyne Prototype: Teleconference = 1.00 hours
*** 2014-04-07 Mon = 8.50 hours
**** Prototype = 8.50 hours
***** Planning = 1.00 hours
****** Yoyodyne Prototype: Teleconference = 1.00 hours
***** Quality = 7.50 hours
****** Yoyodyne Prototype: Write test suite = 7.50 hours
*** 2014-04-08 Tue = 8.50 hours
**** NewProduct = 5.00 hours
***** Planning = 5.00 hours
****** Yoyodyne NewProduct: Project Planning = 5.00 hours
**** Prototype = 3.50 hours
***** Planning = 1.00 hours
****** Yoyodyne Prototype: Teleconference = 1.00 hours
***** Quality = 2.50 hours
****** Yoyodyne Prototype: Setup Jenkins = 2.50 hours
* Weekly
** 2014 week #14: March 31 - April 06
#+BEGIN: columnview :hlines 1 :id global
| /Project/ |  Mon |  Tue |  Wed |  Thu |  Fri |  Sat |  Sun | /Total/ |
|-----------+------+------+------+------+------+------+------+---------|
| Prototype |      | 8.50 | 8.50 | 8.50 | 8.50 |      |      |   34.00 |
|-----------+------+------+------+------+------+------+------+---------|
| /Daily/   | 0.00 | 8.50 | 8.50 | 8.50 | 8.50 | 0.00 | 0.00 |   34.00 |
#+TBLFM: @2$9..@-1$9=vsum($2..$8);%.2f;::@>$2..@>$9='(format "%3.2f" (apply '+ '(@2..@-1)));N;
#+END:
** 2014 week #15: April 07 - April 13
#+BEGIN: columnview :hlines 1 :id global
| /Project/  |  Mon |  Tue |  Wed |  Thu |  Fri |  Sat |  Sun | /Total/ |
|------------+------+------+------+------+------+------+------+---------|
| NewProduct |      | 5.00 |      |      |      |      |      |    5.00 |
| Prototype  | 8.50 | 3.50 |      |      |      |      |      |   12.00 |
|------------+------+------+------+------+------+------+------+---------|
| /Daily/    | 8.50 | 8.50 | 0.00 | 0.00 | 0.00 | 0.00 | 0.00 |   17.00 |
#+TBLFM: @2$9..@-1$9=vsum($2..$8);%.2f;::@>$2..@>$9='(format "%3.2f" (apply '+ '(@2..@-1)));N;
#+END:
* Invoices
* Daily Notes
** 4/9
Demonstrate Yoyodyne time tracking
